import { Pizzerias } from '@/types';

export const pizzerias: Pizzerias[] = [
  {
    id: 0,
    adress: 'Проспект Ленина д.35',
    openingHours: [
      'Пн с 08:00 по 23:00',
      'Вт с 08:00 по 23:00',
      'Ср с 08:00 по 23:00',
      'Чт с 08:00 по 23:00',
      'Пт с 08:00 по 23:00',
      'Сб с 09:00 по 23:00',
      'Вс с 09:00 по 23:00',
    ],
  },
  {
    id: 1,
    adress: 'Проспект Карельский д.20',
    openingHours: [
      'Пн с 07:00 по 01:00',
      'Вт с 07:00 по 01:00',
      'Ср с 07:00 по 01:00',
      'Ср с 07:00 по 01:00',
      'Пт с 07:00 по 02:00',
      'Сб с 07:00 по 02:00',
      'Вс с 07:00 по 01:00',
    ],
  },
  {
    id: 2,
    adress: 'Улица Ленинградская д.12',
    openingHours: [
      'Пн с 08:00 по 01:00',
      'Вт с 08:00 по 01:00',
      'Ср с 08:00 по 01:00',
      'Ср с 08:00 по 01:00',
      'Пт с 08:00 по 02:00',
      'Сб с 09:00 по 02:00',
      'Вс с 09:00 по 01:00',
    ],
  },
  {
    id: 3,
    adress: 'Бульвар Интернационалистов д.20',
    openingHours: [
      'Пн с 08:00 по 01:00',
      'Вт с 08:00 по 01:00',
      'Ср с 08:00 по 01:00',
      'Ср с 08:00 по 01:00',
      'Пт с 08:00 по 02:00',
      'Сб с 09:00 по 02:00',
      'Вс с 09:00 по 01:00',
    ],
  },
  {
    id: 4,
    adress: 'Улица Чапаева д.45',
    openingHours: [
      'Пн с 08:00 по 01:00',
      'Вт с 08:00 по 01:00',
      'Ср с 08:00 по 01:00',
      'Ср с 08:00 по 01:00',
      'Пт с 08:00 по 02:00',
      'Сб с 09:00 по 02:00',
      'Вс с 09:00 по 01:00',
    ],
  },
];
