import React from 'react';

const PrivacyPolicy: React.FC = () => {
  return (
    <main className='mt-[90px] sm:px-4 !px-[60px]'>
      <h1 className='h1 my-[30px] sm:my-4'>Политика конфиденциальности</h1>
      <p className='break-words whitespace-pre-wrap text-justify md:text-sm text-base'>
        Настоящая Политика конфиденциальности персональной информации (далее —
        Политика, для избежания разночтения под персональной информацией
        подразумевается и персональные данные) действует в отношении всей
        информации, которую Общество с ограниченной ответственностью &quot;МБК
        Менеджмент&quot; (далее - ООО &quot;МБК Менеджмент&quot;) и/или его
        аффилированные лица, включая все лица, объединенные в рамках
        франчайзинговой сети под единой торговой маркой «Тик Тайм Пицца» (далее
        - «Тик Тайм Пицца»), могут получить о Пользователе (любое физическое
        лицо, предоставившее «Тик Тайм Пицце» свои персональные данные
        посредством регистрации на сайте www.tick-time.ru) во время
        использования им любого из сайтов, сервисов, служб и программ «Тик Тайм
        Пицца» (далее — Сервисы). Согласие Пользователя на предоставление
        персональной информации, данное им в соответствии с настоящей Политикой
        в рамках отношений с одним из лиц, входящих в «Тик Тайм Пицца»,
        распространяется на все лица, входящие в «Тик Тайм Пицца». Использование
        Сервисов означает безоговорочное согласие Пользователя с настоящей
        Политикой и указанными в ней условиями обработки его персональной
        информации; в случае несогласия с этими условиями Пользователь должен
        воздержаться от использования Сервисов.
        <br />
        <br />
        1. Персональная информация Пользователей, которую получает и
        обрабатывает «Тик Тайм Пицца»
        <br />
        1.1. В рамках настоящей Политики под «персональной информацией
        Пользователя» понимаются:
        <br />
        1.1.1. персональная информация, которую Пользователь предоставляет о
        себе самостоятельно при регистрации (создании учётной записи) или в
        процессе использования Сервисов, включая персональные данные
        Пользователя. Обязательная для предоставления Сервисов (оказания услуг)
        информация помечена специальным образом. Иная информация предоставляется
        Пользователем на его усмотрение.
        <br />
        1.1.2 данные, которые автоматически передаются Сервисам в процессе их
        использования с помощью установленного на устройстве Пользователя
        программного обеспечения, в том числе IP-адрес, информация из cookie,
        информация о браузере Пользователя (или иной программе, с помощью
        которой осуществляется доступ к Сервисам), время доступа, адрес
        запрашиваемой страницы.
        <br />
        1.2. Настоящая Политика применима только к Сервисам «Тик Тайм Пицца».
        «Тик Тайм Пицца» не контролирует и не несет ответственность за сайты
        третьих лиц, на которые Пользователь может перейти по ссылкам, доступным
        на сайтах «Тик Тайм Пицца». На таких сайтах у Пользователя может
        собираться или запрашиваться иная персональная информация, а также могут
        совершаться иные действия.
        <br />
        1.3. «Тик Тайм Пицца» в общем случае не проверяет достоверность
        персональной информации, предоставляемой Пользователями, и не
        осуществляет контроль за их дееспособностью. Однако «Тик Тайм Пицца»
        исходит из того, что Пользователь предоставляет достоверную и
        достаточную персональную информацию по вопросам, предлагаемым в форме
        регистрации, и поддерживает эту информацию в актуальном состоянии.
        Последствия предоставления недостоверной информации определены в
        Публичной оферте (далее - оферта) расположенной на сайте
        www.tick-time.ru в разделе «Правовая информация».
        <br />
        <br />
        2. Цели сбора и обработки персональной информации Пользователей
        <br />
        2.1. «Тик Тайм Пицца» собирает и хранит только те персональные данные,
        которые необходимы для предоставления Сервисов и оказания услуг
        (исполнения оферты и/или иных договоров с Пользователем).
        <br />
        2.2. Персональную информацию Пользователя «Тик Тайм Пицца» может
        использовать в следующих целях:
        <br />
        2.2.1. идентификация стороны в рамках оферты и договоров с «Тик Тайм
        Пицца»;
        <br />
        2.2.2. предоставление Пользователю персонализированных Сервисов;
        <br />
        2.2.3. связь с Пользователем, в том числе направление уведомлений,
        запросов и информации, касающихся использования Сервисов, оказания
        услуг, а также обработка запросов и заявок от Пользователя;
        <br />
        2.2.4. улучшение качества Сервисов, удобства их использования,
        разработка новых Сервисов и услуг;
        <br />
        2.2.5. рекламы своих продуктов и услуг;
        <br />
        2.2.6. проведение статистических и иных исследований на основе
        предоставленных данных.
        <br />
        <br />
        3. Условия обработки персональной информации Пользователя и её передачи
        третьим лицам
        <br />
        3.1. «Тик Тайм Пицца» хранит персональную информацию Пользователей,
        обеспечивая их конфиденциальность и защиту от неправомерного или
        случайного доступа к ним третьих лиц.
        <br />
        3.2.«Тик Тайм Пицца» вправе передать персональную информацию
        Пользователя третьим лицам в следующих случаях:
        <br />
        3.2.1. передача необходима в рамках использования Пользователем
        определенного Сервиса, либо для оказания услуги Пользователю;
        <br />
        3.2.2. такая передача происходит в рамках продажи или иной передачи
        бизнеса (полностью или в части), при этом к приобретателю переходят все
        обязательства по соблюдению условий настоящей Политики применительно к
        полученной им персональной информации;
        <br />
        3.2.3. в целях обеспечения возможности защиты прав и законных интересов
        «Тик Тайм Пицца» или третьих лиц в случаях, когда Пользователь нарушает
        оферту «Тик Тайм Пиццы».
        <br />
        3.4. При обработке персональных данных Пользователей «Тик Тайм Пицца»
        руководствуется Федеральным законом РФ «О персональных данных» от
        27.07.2006 г. №152-ФЗ.
        <br />
        <br />
        4. Меры, применяемые для защиты персональной информации Пользователей
        «Тик Тайм Пицца» принимает необходимые и достаточные организационные и
        технические меры для защиты персональной информации Пользователя от
        неправомерного или случайного доступа, уничтожения, изменения,
        блокирования, копирования, распространения, а также от иных
        неправомерных действий с ней третьих лиц.
        <br />
        <br />
        5. Изменение Политики конфиденциальности «Тик Тайм Пицца» имеет право
        вносить изменения в настоящую Политику. При внесении изменений в
        актуальной редакции указывается дата последнего обновления. Пользователь
        обязуется самостоятельно контролировать наличие изменений в настоящей
        Политике. Новая редакция Политики вступает в силу с момента ее
        размещения, если иное не предусмотрено новой редакцией
        Политики.Действующая редакция всегда находится на сайте www.tick-time.ru
        в разделе «Правовая информация»
        <br />
        <br />
        Уведомления, в случае внесения изменений в настоящую Политику,
        размещаются на сайте www.tick-time.ru в виде информационного сообщения.
      </p>{' '}
    </main>
  );
};

export default PrivacyPolicy;
